concatenation,merge and joining data frames in pandas

In [2]:
import pandas as pd
df1 = pd.DataFrame({'Item':['A','B','C','D'],
                    'Value': [1,2,3,4]})
df2 = pd.DataFrame({'Item':['E','F','G','H'],
                    'Value': [5,6,7,8]})
print(df1)
print(df2)

  Item  Value
0    A      1
1    B      2
2    C      3
3    D      4
  Item  Value
0    E      5
1    F      6
2    G      7
3    H      8

In [3]:
df1

  Item  Value
0    A      1
1    B      2
2    C      3
3    D      4

In [4]:
df2

  Item  Value
0    E      5
1    F      6
2    G      7
3    H      8

In [5]:
pd.concat([df1,df2])

  Item  Value
0    A      1
1    B      2
2    C      3
3    D      4
0    E      5
1    F      6
2    G      7
3    H      8

In [6]:
df1 = pd.DataFrame({'Item':['A','B','C','D'],
                    'Value': [1,2,3,4]})
df2 = pd.DataFrame({'Item':['E','F','G','H'],
                    'value': [5,6,7,8]})
print(df1)
print(df2)

  Item  Value
0    A      1
1    B      2
2    C      3
3    D      4
  Item  value
0    E      5
1    F      6
2    G      7
3    H      8

In [7]:
pd.concat([df1,df2])

  Item  Value  value
0    A    1.0    NaN
1    B    2.0    NaN
2    C    3.0    NaN
3    D    4.0    NaN
0    E    NaN    5.0
1    F    NaN    6.0
2    G    NaN    7.0
3    H    NaN    8.0

In [8]:
df1 = pd.DataFrame({'Item':['A','B','C','D'],
                    'Value': [1,2,3,4]})
df2 = pd.DataFrame({'Item':['E','F','G','H'],
                    'Quantity': [5,6,7,8]})
pd.concat([df1,df2])

  Item  Value  Quantity
0    A    1.0       NaN
1    B    2.0       NaN
2    C    3.0       NaN
3    D    4.0       NaN
0    E    NaN       5.0
1    F    NaN       6.0
2    G    NaN       7.0
3    H    NaN       8.0

In [9]:
df1 = pd.DataFrame({'Item':['A','B','C','D'],
                    'Value': [1,2,3,4]})
df2 = pd.DataFrame({'Item':['E','F','G','H'],
                    'Quantity': [5,6,7,8]})
pd.concat([df1,df2]).reset_index()

   index Item  Value  Quantity
0      0    A    1.0       NaN
1      1    B    2.0       NaN
2      2    C    3.0       NaN
3      3    D    4.0       NaN
4      0    E    NaN       5.0
5      1    F    NaN       6.0
6      2    G    NaN       7.0
7      3    H    NaN       8.0

In [ ]:
df1 = pd.DataFrame({'Item':['A','B','C','D'],
                    'Value': [1,2,3,4]})
df2 = pd.DataFrame({'Item':['E','F','G','H'],
                    'Quantity': [5,6,7,8]})
pd.concat([df1,df2], axis=1)

  Item  Value Item  Quantity
0    A      1    E         5
1    B      2    F         6
2    C      3    G         7
3    D      4    H         8

using append to add multiple dataframes to one another

In [11]:
df1 = pd.DataFrame({'Item':['A','B','C','D'],
                    'Value': [1,2,3,4]})
df2 = pd.DataFrame({'Item':['E','F','G','H'],
                    'Quantity': [5,6,7,8]})
df3 = pd.DataFrame({'Item':['I','J','K','L'],
                    'Quantity': [9,10,11,12]})
df1.append([df2,df3])

  Item  Value  Quantity
0    A    1.0       NaN
1    B    2.0       NaN
2    C    3.0       NaN
3    D    4.0       NaN
0    E    NaN       5.0
1    F    NaN       6.0
2    G    NaN       7.0
3    H    NaN       8.0
0    I    NaN       9.0
1    J    NaN      10.0
2    K    NaN      11.0
3    L    NaN      12.0

In [12]:
dfA = pd.DataFrame({'key':['A','B','C','D'],
                    'A': [1,2,3,4]})
dfB = pd.DataFrame({'key':['E','F','G','H'],
                    'B': [5,6,7,8]})
pd.merge(dfA,dfB, on='key')

Empty DataFrame
Columns: [key, A, B]
Index: []

In [13]:
dfA = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'A': ['A0','A1','A3','A4'],
                    'B': ['B0','B1','B3','B4']})
dfB = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'C': ['C0','C1','C3','C4'],
                    'D': ['D0','D1','D3','D4']})
pd.merge(dfA,dfB, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A3  B3  C3  D3
3  K3  A4  B4  C4  D4

In [14]:
dfA = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'A': ['A0','A1','A3','A4'],
                    'B': ['B0','B1','B3','B4']})
dfB = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'C': ['C0','C1','C3','C4'],
                    'D': ['D0','D1','D3','D4']})
pd.merge(dfA,dfB, how='left', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A3  B3  C3  D3
3  K3  A4  B4  C4  D4

In [15]:
dfA = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'A': ['A0','A1','A3','A4'],
                    'B': ['B0','B1','B3','B4']})
dfB = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'C': ['C0','C1','C3','C4'],
                    'D': ['D0','D1','D3','D4']})
pd.merge(dfA,dfB, how='right', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A3  B3  C3  D3
3  K3  A4  B4  C4  D4

In [ ]:
dfA = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'A': ['A0','A1','A3','A4'],
                    'B': ['B0','B1','B3','B4']})
dfB = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'C': ['C0','C1','C3','C4'],
                    'D': ['D0','D1','D3','D4']})
pd.merge(dfA,dfB, how='left', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A3  B3  C3  D3
3  K3  A4  B4  C4  D4

In [16]:
dfA = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'A': ['A0','A1','A3','A4'],
                    'B': ['B0','B1','B3','B4']})
dfB = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'C': ['C0','C1','C3','C4'],
                    'D': ['D0','D1','D3','D4']})
pd.merge(dfA,dfB, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A3  B3  C3  D3
3  K3  A4  B4  C4  D4

joining

In [17]:
l=pd.DataFrame({'key':['a0','b1','c2','d3'],'A':['e0','f1','g2','h3']},index=['i0','j1','k2','l3'])

In [18]:
l

   key   A
i0  a0  e0
j1  b1  f1
k2  c2  g2
l3  d3  h3

In [19]:
r=pd.DataFrame({'key':['a0','b1','c2','d3'],'A':['e0','f1','g2','h3']},index=['i3','j2','k1','l0'])
r

   key   A
i3  a0  e0
j2  b1  f1
k1  c2  g2
l0  d3  h3

In [ ]:
l=pd.DataFrame({'A':['a0','b1','c2'],'B':['e0','f1','g2']},index=['i0','j1','k2'])

In [20]:
r=pd.DataFrame({'C':['m0','n1','p2'],'D':['r0','s1','t2']},index=['v0','w2','x3'])
l.join(r)

   key   A    C    D
i0  a0  e0  NaN  NaN
j1  b1  f1  NaN  NaN
k2  c2  g2  NaN  NaN
l3  d3  h3  NaN  NaN

In [21]:
l.join(r,how='outer')

    key    A    C    D
i0   a0   e0  NaN  NaN
j1   b1   f1  NaN  NaN
k2   c2   g2  NaN  NaN
l3   d3   h3  NaN  NaN
v0  NaN  NaN   m0   r0
w2  NaN  NaN   n1   s1
x3  NaN  NaN   p2   t2

In [22]:
def computehcf(x,y):
  #choose the smaller number
    if x>y:
      smaller=y
    else:
      smaller=y
    for i in range(1,smaller+1):
      if((x%i==0) and (y%i==0)):
        hcf=i
    return hcf      

num1=int(input("enter the first number\t"))
num2=int(input("enter the second number\t"))
print("the hcf of",num1,"and",num2,"is",computehcf(num1,num2))

enter the first number	43
enter the second number	45
the hcf of 43 and 45 is 1

Dictionaries

In [ ]:
#creating a dictionary
country_info ={"Name": "India","Capital":"Delhi"}
print(country_info)

{'Name': 'India', 'Capital': 'Delhi'}

In [ ]:
country_info ={"Name": "India","Capital":"Delhi"}
print(country_info["Name"])

India

In [ ]:
country_info ={"Name": "India","Capital":"Delhi"}
print(country_info["Capital"])

Delhi

In [ ]:
#creating a dictionary
country_info ={"Name": "Japan","Capital":"Tokoyo"}
print(country_info)
print(country_info["Name"])
print(country_info["Capital"])

{'Name': 'Japan', 'Capital': 'Tokoyo'}
Japan
Tokoyo

In [ ]:
country_info['population']=139.67
print(country_info)

{'Name': 'Japan', 'Capital': 'Tokoyo', 'population': 139.67}

In [ ]:
print(country_info)
country_info['regions']=['Hokkaido','Tohoku', 'Kanto',' Chubu', 'Kinki',' Chugoku', 'Shikoku',' Kyushu-Okinawa']
print(country_info)

{'Name': 'Japan', 'Capital': 'Tokoyo', 'population': 139.67}
{'Name': 'Japan', 'Capital': 'Tokoyo', 'population': 139.67, 'regions': ['Hokkaido', 'Tohoku', 'Kanto', ' Chubu', 'Kinki', ' Chugoku', 'Shikoku', ' Kyushu-Okinawa']}

In [ ]:
x=2
y=3
#Addition
print("addition of x and y is ",x+y)
#subtraction
print("subtraction of x and y is ",x-y)
#multiplication
print("multiplication of x and y is",x*y)
#division
print("division of x and y is ",x/y)
print("thank you")

addition of x and y is  5
subtraction of x and y is  -1
multiplication of x and y is 6
division of x and y is  0.6666666666666666
thank you

conditional statement -----If and Else

In [ ]:
#using if statement
x=19
if x<10 :
  print("number is less than 10")
else:
    print("numberis over the 10")

numberis over the 10

In [ ]:
#using if statement
x=1
if x<10 :
  print("number is less than 10")
else:
    print("numberis over the 10")

number is less than 10

In [ ]:
#using if statement
x=1
if x<10 :
  print("number is less than 10")
elif x>10 and x<=19 :
  print("greater than 10less than 19")
else:
    print("numberis over the 20")

number is less than 20

boolean conditon

In [ ]:
a= True
if a:
  print("statement is true")

statement is true

loops

In [ ]:
print(list(range(5)))

[0, 1, 2, 3, 4]

In [ ]:
print(list(range(1,5)))

[1, 2, 3, 4]

In [ ]:
for i in range(0,5):
 print(i)

0
1
2
3
4

In [ ]:
items=['a','b','c','d']
for i in items:
   print(i)

a
b
c
d

In [ ]:
#while loops

In [ ]:
x=0
while x<5:
   x += 1
   print(x)

1
2
3
4
5

In [ ]:
x=0
while True :
   if x==5:
      break
   x+=1
   print(x)

1
2
3
4
5

fuctions

In [ ]:
#simple functions to area of circle
def Areaofcircle(radius):
  
area=3.142*(radius**2)
return area

In [ ]:
# Simple Functions to Return Area of Circle
def Areacircle(radius):
    area = 3.14 * (radius**2)
    return area

In [ ]:
Areacircle(4)

50.24

In [ ]:
#simple functions to return volume of cylinder
def volumecylinder(radius,height):
 volume=3.142*radius**2*height
 return volume

In [ ]:
volumecylinder(60,40)

452447.99999999994